<script setup lang="ts">
import { Carousel } from 'src/shared'
import { FeedBack } from 'src/widgets'
import { AboutLanding } from 'src/features/About'
const items = [
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
]
</script>
<template>
    <div
        class="px-[20px] my-[32px] w-full flex flex-col gap-[48px] max-w-[1408px] mx-auto"
    >
        <AboutLanding />
        <Carousel
            :header="'Блог'"
            RouterLinkName="BlogTypePage"
            :items="items"
        />
        <FeedBack />
    </div>
</template>
