<script setup lang="ts">
import { FeedBack } from 'src/widgets'
import FAQCategories from 'src/features/FAQ/components/FAQCategories/FAQCategories.vue'
import { AnswerBlocks } from 'src/features/FAQ/components/AnswerBlocks'

const answers = [
    {
        header: 'Какой у вас опыт в этой области?',
        description:
            'Более 15 лет. У нас многолетний опыт работы в строительной отрасли, мы успешно реализовали множество проектов, включая жилые, коммерческие и промышленные объекты.',
    },
    {
        header: 'Каковы ваши расценки и как определяется стоимость проекта?',
        description:
            'Стоимость проекта зависит от многих факторов: типа объекта, объема работ, используемых материалов и сроков реализации. Мы предоставляем прозрачные расчеты и готовы обсуждать детали на предварительных консультациях.',
    },
    {
        header: 'Каковы сроки завершения проекта?',
        description:
            'Сроки выполнения проекта зависят от его масштаба и сложности. Мы устанавливаем реалистичные сроки и делаем все возможное, чтобы их соблюдать, постоянно информируя клиентов о ходе работ.',
    },
    {
        header: 'Есть ли у вас лицензии и сертификаты?',
        description:
            'Да, у нас есть все необходимые лицензии и сертификаты, подтверждающие нашу квалификацию и право на выполнение строительных работ.',
    },
    {
        header: 'Какой у вас опыт в этой области?',
        description:
            'Более 15 лет. У нас многолетний опыт работы в строительной отрасли, мы успешно реализовали множество проектов, включая жилые, коммерческие и промышленные объекты.',
    },
    {
        header: 'Каковы ваши расценки и как определяется стоимость проекта?',
        description:
            'Стоимость проекта зависит от многих факторов: типа объекта, объема работ, используемых материалов и сроков реализации. Мы предоставляем прозрачные расчеты и готовы обсуждать детали на предварительных консультациях.',
    },
    {
        header: 'Каковы сроки завершения проекта?',
        description:
            'Сроки выполнения проекта зависят от его масштаба и сложности. Мы устанавливаем реалистичные сроки и делаем все возможное, чтобы их соблюдать, постоянно информируя клиентов о ходе работ.',
    },
    {
        header: 'Есть ли у вас лицензии и сертификаты?',
        description:
            'Да, у нас есть все необходимые лицензии и сертификаты, подтверждающие нашу квалификацию и право на выполнение строительных работ.',
    },
]
</script>

<template>
    <div class="flex flex-col gap-[32px] py-[32px]">
        <div>
            <h1>Частые вопросы</h1>
        </div>
        <div class="flex sm:flex-row gap-[32px]">
            <FAQCategories class="static" />
            <AnswerBlocks
                :answers="answers"
                style="height: 80vh"
                class="sm:flex-1 overflow-y-scroll"
            />
        </div>
    </div>
</template>
