<script setup lang="ts">
import MainPageLanding from '../../widgets/MainPageLanding/MainPageLanding.vue'
import { ServicesScreen } from '@/features'
import { ProjectsScreen } from '@/features'
import { Carousel } from '@/shared/ui'
import { QBtn } from 'quasar'
import { AnswerBlocks } from 'src/widgets/AnswerBlocks'
import { IAnswer } from 'src/shared/types/answer'
import { ref } from 'vue'
import arrowRight from 'src/shared/assets/icons/arrow-right.svg'

const items = [
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
]

const answers = ref<IAnswer[]>([
    {
        header: 'Какой у вас опыт в этой области?',
        description:
            'Более 15 лет. У нас многолетний опыт работы в строительной отрасли, мы успешно реализовали множество проектов, включая жилые, коммерческие и промышленные объекты.',
    },
    {
        header: 'Каковы ваши расценки и как определяется стоимость проекта?',
        description:
            'Стоимость проекта зависит от многих факторов: типа объекта, объема работ, используемых материалов и сроков реализации. Мы предоставляем прозрачные расчеты и готовы обсуждать детали на предварительных консультациях.',
    },
    {
        header: 'Каковы сроки завершения проекта?',
        description:
            'Сроки выполнения проекта зависят от его масштаба и сложности. Мы устанавливаем реалистичные сроки и делаем все возможное, чтобы их соблюдать, постоянно информируя клиентов о ходе работ.',
    },
    {
        header: 'Есть ли у вас лицензии и сертификаты?',
        description:
            'Да, у нас есть все необходимые лицензии и сертификаты, подтверждающие нашу квалификацию и право на выполнение строительных работ.',
    },
    {
        header: 'Какой у вас опыт в этой области?',
        description:
            'Более 15 лет. У нас многолетний опыт работы в строительной отрасли, мы успешно реализовали множество проектов, включая жилые, коммерческие и промышленные объекты.',
    },
    {
        header: 'Каковы ваши расценки и как определяется стоимость проекта?',
        description:
            'Стоимость проекта зависит от многих факторов: типа объекта, объема работ, используемых материалов и сроков реализации. Мы предоставляем прозрачные расчеты и готовы обсуждать детали на предварительных консультациях.',
    },
    {
        header: 'Каковы сроки завершения проекта?',
        description:
            'Сроки выполнения проекта зависят от его масштаба и сложности. Мы устанавливаем реалистичные сроки и делаем все возможное, чтобы их соблюдать, постоянно информируя клиентов о ходе работ.',
    },
    {
        header: 'Есть ли у вас лицензии и сертификаты?',
        description:
            'Да, у нас есть все необходимые лицензии и сертификаты, подтверждающие нашу квалификацию и право на выполнение строительных работ.',
    },
])
</script>
<template>
    <div class="w-full container">
        <MainPageLanding />
        <h2 class="mb-[48px]">Наши услуги</h2>
        <ServicesScreen></ServicesScreen>
        <h2 class="">Наши проекты</h2>
        <p class="text__light-secondary">
            То, чего мы не стыдимся. Наша гордость и усилия.
        </p>
        <ProjectsScreen />
        <div class="flex justify-center py-[32px]">
            <Carousel
                header="Новости"
                :items="items"
                class="mb-[48px]"
            ></Carousel>
            <QBtn
                :outline="true"
                size="md"
                class="normal-case text-center"
                >Больше новостей<arrowRight class="ml-[8px]"
            /></QBtn>
        </div>
        <div class="flex justify-center gap-[32px] py-[32px]">
            <div class="flex justify-beetween flex-nowrap">
                <h2 class="basis-2/5">Частые вопросы</h2>
                <AnswerBlocks :answers="answers"></AnswerBlocks>
            </div>
            <QBtn :outline="true" size="md" class="normal-case"
                >Больше ответов<arrowRight class="ml-[8px]"
            /></QBtn>
        </div>
        <div class="flex py-[32px] gap-[32px]">
            <h2>
                Строительные проекты выполняются качественно и в срок,
                что особенно важно в сфере строительства и ремонта.
                Команда настоящих профессионалов всегда на связи,
                предлагает оптимальные решения и тщательно
                контролирует все этапы работ.
            </h2>
            <div class="flex items-center gap-[10px]">
                <div
                    class="bg__secondary rounded-full h-[64px] w-[64px]"
                ></div>
                <div>
                    <p class="m-[0px]">Наталья Савостьянова</p>
                    <p class="text__light-secondary m-[0px]">
                        Глава представительства Фалкондэйл Девелопмент
                        Лимитед
                    </p>
                </div>
            </div>
        </div>

        <div class="flex justify-center py-[32px]">
            <Carousel
                header="Блог"
                :items="items"
                class="mb-[48px]"
            ></Carousel>
            <QBtn
                :outline="true"
                size="md"
                class="normal-case text-center"
                >Весь блог<arrowRight class="ml-[8px]"
            /></QBtn>
        </div>
    </div>
</template>
