<script setup lang="ts">
import { Carousel } from 'src/shared'
import FeedBack from 'src/widgets/FeedBack/FeedBack.vue'
import { QBtn } from 'quasar'
import arrowRight from 'src/shared/assets/icons/arrow-right.svg'
import ServicesScreen from 'src/features/Services/ServicesScreen.vue'

const items = [
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
]
</script>
<template>
    <div class="w-full px-[20px] py-[32px] max-w-[1408px] mx-auto">
        <div class="flex flex-col gap-[32px] mb-[48px]">
            <h1 class="">Наши услуги</h1>
            <p class="text__light-secondary mb-[0px]">
                Наша компания предлагает полный спектр строительных
                услуг – от проектирования и капитального ремонта до
                комплексного строительства объектов любой сложности.
                Мы обеспечиваем контроль на всех этапах, гарантируем
                высокое качество работ и соблюдение сроков. Подробно
                ознакомиться с каждым направлением вы можете ниже.
            </p>
            <div>
                <QBtn
                    :outline="true"
                    size="md"
                    class="normal-case text-center"
                    >Проконсультироваться по услугам<arrowRight
                        class="ml-[8px]"
                /></QBtn>
            </div>
        </div>
        <ServicesScreen />
        <div class="w-full flex flex-col items-center pb-[32px]">
            <Carousel
                header="Блог"
                :items="items"
                :RouterLinkName="'BlogTypePage'"
            ></Carousel>
            <div>
                <QBtn
                    :outline="true"
                    size="md"
                    class="normal-case text-center"
                    >Весь блог<arrowRight class="ml-[8px]"
                /></QBtn>
            </div>
        </div>
        <FeedBack />
    </div>
</template>
