<script setup lang="ts"></script>
<template>
    <h1>О компании</h1>
    <div class="flex gap-[32px]">
        <h4 class="sm:flex-1">
            ООО "МЕГА" — молодая, но динамично развивающаяся
            строительная компания, основанная чуть более года назад.
            Несмотря на относительно недолгое существование,
            основатели компании обладают более чем 20-летним опытом в
            сфере строительства. Этот богатый опыт помогает нам
            уверенно занимать место среди лидеров на рынке и
            обеспечивать высокое качество исполнения каждого проекта.
        </h4>
        <h4 class="sm:flex-1">
            Нашей главной задачей является создание современных
            объектов строительства, соответствующих всем стандартам и
            требованиям времени. Мы активно внедряем инновационные
            технологии и процессы цифровизации для повышения
            эффективности и качества строительных работ. Автоматизация
            и оптимизация производственных процессов позволяют нам
            гарантировать строгое соблюдение сроков, снижение издержек
            и максимальное удовлетворение потребностей наших клиентов.
        </h4>
    </div>
    <div class="flex flex-col gap-[32px]">
        <div class="flex gap-[32px] sm:flex-nowrap">
            <div
                class="grow p-[32px] bg__secondary max-w-1/2 rounded-[16px]"
            >
                <h2>
                    <span class="text__light-secondary text-xl"
                        >Более
                    </span>
                    50 000 м2 недвижимости
                </h2>
                <h4 class="text-wrap">
                    ввела в эксплуатацию наша компания за годы своей
                    работы, успешно выполняя многочисленные заказы в
                    сфере строительства.
                </h4>
            </div>
            <div class="w-full flex flex-col gap-[32px]">
                <div
                    class="p-[32px] rounded-[16px]"
                    style="background-color: var(--color--blue-500)"
                >
                    <h2 class="text-white">
                        <span class="text__dark-secondary text-xl"
                            >Свыше
                        </span>
                        10 крупных проектов
                    </h2>
                    <h4 class="text-white">
                        по капитальному ремонту, строительству и
                        реконструкции зданий реализовано.
                    </h4>
                </div>
                <div class="p-[32px] rounded-[16px] bg__secondary">
                    <h2>
                        <span class="text__light-secondary text-xl">
                            Не менее
                        </span>
                        95% клиентов
                    </h2>
                    <h4>
                        остались довольны качеством и сроками
                        выполнения работ.
                    </h4>
                </div>
            </div>
        </div>

        <div
            class="p-[32px] rounded-[16px]"
            style="background-color: var(--color--blue-500)"
        >
            <h2 class="text-white">
                <span class="text__dark-secondary text-xl"
                    >Более
                </span>
                30 ведущих поставщиков и подрядчиков
            </h2>
            <h4 class="text-white">
                с которыми мы сотрудничаем и введем близкие
                партнерские связи.
            </h4>
        </div>
    </div>
    <h4>
        Мы строим будущее, используя передовые технологии и опыт
        прошлых лет. Наша миссия — создавать качественные, надежные и
        долговечные строительные объекты, которые будут отвечать
        современным требованиям и превосходить ожидания наших
        клиентов.
    </h4>
</template>
