<template>
    <div class="flex py-[32px] gap-[32px]">
        <h2>
            Строительные проекты выполняются качественно и в срок, что
            особенно важно в сфере строительства и ремонта. Команда
            настоящих профессионалов всегда на связи, предлагает
            оптимальные решения и тщательно контролирует все этапы
            работ.
        </h2>
        <div class="flex items-center gap-[10px]">
            <div
                class="bg__secondary rounded-full h-[64px] w-[64px]"
            ></div>
            <div>
                <p class="m-[0px]">Наталья Савостьянова</p>
                <p class="text__light-secondary m-[0px]">
                    Глава представительства Фалкондэйл Девелопмент
                    Лимитед
                </p>
            </div>
        </div>
    </div>
</template>
