export const items = [
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
        id: '8',
        img: 'assad',
    },
]
