<script setup lang="ts"></script>

<template>
    <div class="flex flex-col gap-[32px]">
        <div>
            <h4 class="mb-[16px]">Как это работает?</h4>
            <p class="description">
                Вы выбираете услугу, описываете задачу и оставляете
                заказ. Специалисты видят ваш заказ и отправляют
                предложения, иногда с ценой и контактами. Искать
                специалистов также можно самостоятельно. Когда
                выберете подходящего, свяжитесь с ним по телефону или
                в чате. Договоритесь о работе. После завершения работ
                оставьте отзыв о работе специалиста — это поможет
                сделать выбор другим клиентам.
            </p>
        </div>
        <div>
            <h4 class="mb-[16px]">Это бесплатно?</h4>
            <p class="description">
                Поиск специалистов бесплатный. Вы платите только за
                работу напрямую специалистам. Cпециалисты платят
                сервису за возможность предложить вам свои услуги.
            </p>
        </div>
        <div>
            <h4 class="mb-[16px]">Как оставить заказ?</h4>
            <p class="description">
                Выберите услугу в списке или найдите услугу через
                поиск. Вы увидите вопросы-подсказки. Они помогут
                описать детали задачи, необходимые для специалистов.
                Укажите номер телефона и нажмите "Создать заказ".
            </p>
        </div>
        <div>
            <h4 class="mb-[16px]">Зачем оставлять номер телефона?</h4>
            <p class="description">
                Чтобы специалист мог вам позвонить, если вы его
                выберете. Мы не покажем ваш телефон больше никому и не
                станем слать рекламные СМС.
            </p>
        </div>
    </div>
</template>

<style scoped>
.description {
    margin: 0px;
}
</style>
