<script setup lang="ts">
import FAQScreen from 'src/features/FAQ/FAQScreen.vue'
import FeedBack from 'src/widgets/FeedBack/FeedBack.vue'
import { Carousel } from 'src/shared'
import { QBtn } from 'quasar'
import arrowRight from 'src/shared/assets/icons/arrow-right.svg'

const items = [
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
    {
        name: 'Планы на Будущее: ООО "МЕГА" Анонсирует Новые Проекты на 2024 Год',
        description:
            'Остоженка 25 — удобный офис в центре Москвы, где продумано всё для комфортной и эффективной работы.',
        date: '16 сентября, 2024',
    },
]
</script>
<template>
    <div class="px-[20px]">
        <FAQScreen />
        <div class="flex justify-center py-[32px]">
            <Carousel
                header="Блог"
                :items="items"
                class="mb-[16px]"
            ></Carousel>
            <QBtn
                :outline="true"
                size="md"
                class="normal-case text-center"
                >Весь блог<arrowRight class="ml-[8px]"
            /></QBtn>
        </div>
        <FeedBack />
    </div>
</template>
